{"loss": "binary_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "name": "main_input", "input_dtype": "int32"}, "inbound_nodes": [], "name": "main_input"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 100, "batch_input_shape": [null, 100], "W_regularizer": null, "dropout": 0, "output_dim": 32, "input_length": 100}, "inbound_nodes": [[["main_input", 0, 0]]], "name": "embedding_1"}, {"class_name": "Sequential", "config": [{"class_name": "Convolution1D", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 2, "b_regularizer": null, "init": "uniform", "bias": true, "nb_filter": 256, "activation": "relu", "input_dtype": "float32", "subsample_length": 1, "batch_input_shape": [null, 100, 32], "W_regularizer": null, "input_dim": null, "border_mode": "same"}}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S(\u0003\u0000\u0000\u0000Nt\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0003\u0000\u0000\u0000sum(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s,\u0000\u0000\u0000/home/jsaxe/research_code/modeling/models.pyt\u0006\u0000\u0000\u0000sum_1d\u0016\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [256], "output_shape_type": "raw"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}], "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "sequential_1"}, {"class_name": "Sequential", "config": [{"class_name": "Convolution1D", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 3, "b_regularizer": null, "init": "uniform", "bias": true, "nb_filter": 256, "activation": "relu", "input_dtype": "float32", "subsample_length": 1, "batch_input_shape": [null, 100, 32], "W_regularizer": null, "input_dim": null, "border_mode": "same"}}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S(\u0003\u0000\u0000\u0000Nt\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0003\u0000\u0000\u0000sum(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s,\u0000\u0000\u0000/home/jsaxe/research_code/modeling/models.pyt\u0006\u0000\u0000\u0000sum_1d\u0016\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [256], "output_shape_type": "raw"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}], "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "sequential_2"}, {"class_name": "Sequential", "config": [{"class_name": "Convolution1D", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 4, "b_regularizer": null, "init": "uniform", "bias": true, "nb_filter": 256, "activation": "relu", "input_dtype": "float32", "subsample_length": 1, "batch_input_shape": [null, 100, 32], "W_regularizer": null, "input_dim": null, "border_mode": "same"}}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S(\u0003\u0000\u0000\u0000Nt\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0003\u0000\u0000\u0000sum(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s,\u0000\u0000\u0000/home/jsaxe/research_code/modeling/models.pyt\u0006\u0000\u0000\u0000sum_1d\u0016\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", "name": "lambda_3", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [256], "output_shape_type": "raw"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}], "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "sequential_3"}, {"class_name": "Sequential", "config": [{"class_name": "Convolution1D", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_4", "activity_regularizer": null, "trainable": true, "filter_length": 5, "b_regularizer": null, "init": "uniform", "bias": true, "nb_filter": 256, "activation": "relu", "input_dtype": "float32", "subsample_length": 1, "batch_input_shape": [null, 100, 32], "W_regularizer": null, "input_dim": null, "border_mode": "same"}}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S(\u0003\u0000\u0000\u0000Nt\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0003\u0000\u0000\u0000sum(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000X(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s,\u0000\u0000\u0000/home/jsaxe/research_code/modeling/models.pyt\u0006\u0000\u0000\u0000sum_1d\u0016\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [256], "output_shape_type": "raw"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}], "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "sequential_4"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["sequential_1", 1, 0], ["sequential_2", 1, 0], ["sequential_3", 1, 0], ["sequential_4", 1, 0]]], "name": "merge_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1024}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_5"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1024}, "inbound_nodes": [[["dropout_5", 0, 0]]], "name": "dense_2"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dropout_6"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["dropout_6", 0, 0]]], "name": "dense_3"}], "input_layers": [["main_input", 0, 0]], "output_layers": [["dense_3", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}